% rebase('layout.tpl', title='Домашняя страница', year=year)

<div class="jumbotron">
    <h1>Модели гибели и размножения</h1>
</div>

<div id="theoryGrid">
    <main>
        <p>На этом сайте вы найдете информацию и интерактивные модели, демонстрирующие различные процессы, связанные с жизнью, гибелью и размножением в биологических системах. Мы предлагаем теоретические материалы и симуляции, которые помогут вам лучше понять сложные явления, происходящие в природе.</p>
        <section id="introduction">
            <h2>Наши модели</h2>
            <p>На этом сайте вы найдете информацию и интерактивные модели, демонстрирующие различные процессы, связанные с жизнью, гибелью и размножением в биологических системах. Мы предлагаем теоретические материалы и симуляции, которые помогут вам лучше понять сложные явления, происходящие в природе.</p>
        </section>

        <ul>
            <li><h3><a href="/game_of_life">Игра "Жизнь" Джона Конвея</a></h3></li>
            <li><h3><a href="/infect">Модель распространения инфекции</a></h3></li>
            <li><h3><a href="/underwater_world">Подводный мир</a></h3></li>
            <li><h3><a>Волчий остров</a></h3></li>
        </ul>
        
        <section id="purpose">
            <h2>Цель нашего сайта</h2>
            <p>Мы стремимся предоставить вам инструменты для изучения и понимания биологических процессов через интерактивные модели. Наши ресурсы подходят для студентов, преподавателей, исследователей и всех, кто интересуется биологией и моделированием.</p>
        </section>

        <section id="instructions">
            <h2>Как пользоваться сайтом</h2>
            <ul>
                <li><p><strong>Навигация по страницам:</strong> Используйте меню навигации, чтобы перейти к различным разделам сайта.</p></li>
                <li><p><strong>Просмотр теории:</strong> На каждой странице модели вы найдете теоретические материалы, объясняющие основные концепции и правила.</p></li>
                <li><p><strong>Интерактивные симуляции:</strong> Воспользуйтесь нашими интерактивными моделями, чтобы проводить эксперименты и наблюдать за различными процессами.</p></li>
            </ul>
        </section>
    </main>
</div>
